import 'package:flutter/material.dart';

class Privite extends StatelessWidget {
  const Privite({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      
      appBar: AppBar(backgroundColor: Colors.white,title: Center(child: Text('سياسة الخصوصية'),),),
      backgroundColor: Colors.white,
      body: Center(
        child: ListView(children: [
          Text(textAlign: TextAlign.right, '''
          
          
      نحن في [نطق ] نحترم خصوصيتك ونلتزم بحماية معلوماتك الشخصية أثناء استخدامك للتطبيق الذي يساعد الأشخاص الصم على تحويل الصوت إلى نص. توضح سياسة الخصوصية هذه كيفية جمع واستخدام وحماية بياناتك عند استخدام تطبيقنا.
      
      1. المعلومات التي نقوم بجمعها نقوم بجمع المعلومات التالية:
      
      المعلومات الشخصية: مثل اسم المستخدم، البريد الإلكتروني (إذا تم التسجيل).
      المعلومات التقنية: مثل نوع الجهاز، نظام التشغيل، عنوان IP.
      الصوت: نقوم بجمع الصوت الذي يتم تحويله إلى نص فقط أثناء استخدامك للتطبيق. لا يتم تخزين الصوت بعد تحوله إلى نص.
      2. كيفية استخدام المعلومات نستخدم المعلومات التي نجمعها لأغراض محددة:
      
      لتحويل الصوت إلى نص بدقة.
      لتحسين الأداء وتوفير تجربة مستخدم أفضل.
      لتحليل البيانات التقنية وتحسين التطبيق.
      3. حماية المعلومات نلتزم بحماية معلوماتك باستخدام تدابير أمنية معقولة مثل:
      
      تشفير البيانات أثناء النقل.
      الحفاظ على أمان البيانات في كل مراحل معالجتها.
      عدم تخزين الصوت بعد تحويله إلى نص.
      4. مشاركة المعلومات نحن لا نشارك معلوماتك الشخصية مع أطراف ثالثة إلا في الحالات التالية:
      
      مع مزودي الخدمات الذين يساعدون في تقديم خدمات التطبيق.
      عندما نلتزم قانونًا بتقديم المعلومات للسلطات المختصة.
      5. حقوقك
      
      الوصول إلى بياناتك: يحق لك الوصول إلى البيانات التي جمعناها.
      تعديل أو حذف بياناتك: يمكنك تعديل أو حذف بياناتك في أي وقت من إعدادات التطبيق.
      إلغاء الاشتراك: يمكنك إلغاء الاشتراك في الإشعارات أو الرسائل إذا كنت ترغب.
      6. جمع الصوت وتحويله إلى نص يتم جمع الصوت فقط لتحويله إلى نص عبر التطبيق. بعد التحويل، لا يتم تخزين الصوت أو استخدامه لأغراض أخرى. نحن نلتزم بالحفاظ على خصوصية الصوت الذي تم جمعه.
      
      7. الأطفال والخصوصية لا نقوم بجمع معلومات من الأطفال دون سن 13 عامًا بشكل مقصود. إذا كنت والدًا أو وصيًا على طفل وترى أن بيانات طفلك قد تم جمعها، يمكنك الاتصال بنا لإزالتها.
      
      8. التعديلات على سياسة الخصوصية قد نقوم بتحديث سياسة الخصوصية هذه بين الحين والآخر. سنقوم بنشر أي تغييرات على هذه الصفحة مع تحديث تاريخ "آخر تحديث".
      
      9. الاتصال بنا إذا كان لديك أي استفسارات حول سياسة الخصوصية هذه، يمكنك الاتصال بنا عبر البريد الإلكتروني: [     notkcontact@gmail.com].
      
      
          '''),
        ]),
      ),
    );
  }
}
